apache/nuttx/arch/arm/src/stm32h5/stm32_usbfs.c
#ifdef CONFIG_STM32_USBFS_REGDEBUG
static uint32_t stm32_getreg(uint32_t addr)
{
  static uint32_t prevaddr = 0;
  static uint32_t preval = 0;
  static uint32_t count = 0;

  /* Read the value from the register */

  uint32_t val = getreg32(addr);

  /* Is this the same value that we read from the same register last time?
   * Are we polling the register?  If so, suppress some of the output.
   */

  if (addr == prevaddr && val == preval)
    {
      if (count == 0xffffffff || ++count > 3)
        {
          if (count == 4)
            {
              uinfo("...\n");
            }

          return val;
        }
    }

  /* No this is a new address or value */

  else
    {
      /* Did we print "..." for the previous value? */

      if (count > 3)
        {
          /* Yes.. then show how many times the value repeated */

          uinfo("[repeats %d more times]\n", count - 3);
        }

      /* Save the new address, value, and count */

      prevaddr = addr;
      preval   = val;
      count    = 1;
    }

  /* Show the register value read */

  uinfo("%08" PRIx32 "->%04" PRIx32 "\n", addr, val);
  return val;
}
#endif

/****************************************************************************
 * Name: stm32_putreg
 ****************************************************************************/

#ifdef CONFIG_STM32_USBFS_REGDEBUG
static void stm32_putreg(uint32_t val, uint32_t addr)
{
  /* Show the register value being written */

  uinfo("%08" PRIx32 "<-%04" PRIx32 "\n", addr, val);

  /* Write the value */

  putreg32(val, addr);
}
#endif

/****************************************************************************
 * Name: stm32_dumpep
 ****************************************************************************/

#ifdef CONFIG_STM32_USBFS_REGDEBUG
static void stm32_dumpep(int epno)
{
  uint32_t addr;

  /* Common registers */

  uinfo("CNTR:   %04" PRIx32 "\n", getreg32(STM32_USB_CNTR));
  uinfo("ISTR:   %04" PRIx32 "\n", getreg32(STM32_USB_ISTR));
  uinfo("FNR:    %04" PRIx32 "\n", getreg32(STM32_USB_FNR));
  uinfo("DADDR:  %04" PRIx32 "\n", getreg32(STM32_USB_DADDR));
  uinfo("BTABLE: %04" PRIx32 "\n", getreg32(STM32_USB_BTABLE));

  /* Endpoint register */

  addr = STM32_USB_EPR(epno);
  uinfo("EPR%d:   [%08" PRIx32 "] %04" PRIx32 "\n",
        epno, addr, getreg32(addr));

  /* Endpoint descriptor */

  addr = STM32_USB_BTABLE_ADDR(epno, 0);
  uinfo("DESC:   %08" PRIx32 "\n", addr);

  /* Endpoint buffer descriptor */

  addr = STM32_USB_TX(epno);
  uinfo("  TX BUF:  [%08" PRIx32 "] %04" PRIx32 "\n",  addr, getreg32(addr));

  addr = STM32_USB_RX(epno);
  uinfo("  RX BUF:  [%08" PRIx32 "] %04" PRIx32 "\n",  addr, getreg32(addr));
}
#endif

/****************************************************************************
 * Name: stm32_checksetup
 ****************************************************************************/

#ifdef CONFIG_STM32_USBFS_REGDEBUG
static void stm32_checksetup(void)
{
  uint32_t cfgr     = getreg32(STM32_RCC_CFGR);
  uint32_t apb1rstr = getreg32(STM32_RCC_APB1RSTR1);
  uint32_t apb1enr  = getreg32(STM32_RCC_APB1ENR1);

  uinfo("CFGR: %08" PRIx32 " APB1RSTR: %08" PRIx32
        " APB1ENR: %08" PRIx32 "\n",
         cfgr, apb1rstr, apb1enr);

  if ((apb1rstr & RCC_APB1RSTR1_USBRST) != 0 ||
      (apb1enr & RCC_APB1ENR1_USBEN) == 0)
    {
      uerr("ERROR: USB is NOT setup correctly\n");
    }
}
#endif

/****************************************************************************
 * Low-Level Helpers
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_seteptxcount
 ****************************************************************************/

static inline void stm32_seteptxcount(uint8_t epno, uint16_t count)
{
  uint32_t txbd;
  volatile uint32_t *epaddr = (uint32_t *)STM32_USB_TX(epno);
  txbd = (*epaddr & 0x0000ffff) | (count << 16);
  *epaddr = txbd;
}

/****************************************************************************
 * Name: stm32_seteptxaddr
 ****************************************************************************/

static inline void stm32_seteptxaddr(uint8_t epno, uint16_t addr)
{
  uint32_t txbd;
  volatile uint32_t *txaddr = (uint32_t *)STM32_USB_TX(epno);
  txbd = (*txaddr & 0xffff0000) | addr;
  *txaddr = txbd;
}

/****************************************************************************
 * Name: stm32_geteptxaddr
 ****************************************************************************/

static inline uint16_t stm32_geteptxaddr(uint8_t epno)
{
  uint32_t eptxaddr;
  volatile uint32_t *txaddr = (uint32_t *)STM32_USB_TX(epno);
  eptxaddr = ((uint32_t)*txaddr) & 0x0000ffff;
  return (uint16_t) eptxaddr;
}

/****************************************************************************
 * Name: stm32_seteprxcount
 ****************************************************************************/

static void stm32_seteprxcount(uint8_t epno, uint16_t count)
{
  uint32_t rxbd;
  volatile uint32_t *epaddr = (uint32_t *)STM32_USB_RX(epno);
  uint32_t rxcount = 0;
  uint32_t nblocks;

  /* The upper bits of the RX COUNT value contain the size of allocated
   * RX buffer.  This is based on a block size of 2 or 32:
   *
   * USB_COUNT_RX_BL_SIZE not set:
   *   nblocks is in units of 2 bytes.
   *     00000 - not allowed
   *     00001 - 2 bytes
   *     ....
   *     11111 - 62 bytes
   *
   * USB_COUNT_RX_BL_SIZE set:
   *     00000 - 32 bytes
   *     00001 - 64 bytes
   *     ...
   *     01111 - 512 bytes
   *     11111 - 1024 bytes
   */

  if (count > 62)
    {
      /* Blocks of 32 (with 0 meaning one block of 32) */

      nblocks = (count >> 5) - 1 ;
      DEBUGASSERT(nblocks <= 0x0f);
      rxcount = (uint32_t)((nblocks <<
                            USB_COUNT_RX_NUM_BLOCK_SHIFT) |
                            USB_COUNT_RX_BL_SIZE);
    }
  else if (count > 0)
    {
      /* Blocks of 2 (with 1 meaning one block of 2) */

      nblocks = (count + 1) >> 1;
      DEBUGASSERT(nblocks > 0 && nblocks < 0x1f);
      rxcount = (uint32_t)(nblocks << USB_COUNT_RX_NUM_BLOCK_SHIFT);
    }
  rxbd = (*epaddr & 0x0000ffff) | rxcount;
  *epaddr = rxbd;
}

/****************************************************************************
 * Name: stm32_geteprxcount
 ****************************************************************************/

static inline uint16_t stm32_geteprxcount(uint8_t epno)
{
  volatile uint32_t *epaddr = (uint32_t *)STM32_USB_RX(epno);
  return (((*epaddr) & USB_COUNT_RX_MASK) >> 16);
}

/****************************************************************************
 * Name: stm32_seteprxaddr
 ****************************************************************************/

static inline void stm32_seteprxaddr(uint8_t epno, uint16_t addr)
{
  uint32_t rxbd;
  volatile uint32_t *rxaddr = (uint32_t *)STM32_USB_RX(epno);
  rxbd = (*rxaddr & 0xffff0000) | addr;
  *rxaddr = rxbd;
}

/****************************************************************************
 * Name: stm32_seteprxaddr
 ****************************************************************************/

static inline uint16_t stm32_geteprxaddr(uint8_t epno)
{
  uint32_t eprxaddr;
  volatile uint32_t *rxaddr = (uint32_t *)STM32_USB_RX(epno);
  eprxaddr = ((uint32_t)*rxaddr) & 0x0000ffff;
  return (uint16_t) eprxaddr;
}

/****************************************************************************
 * Name: stm32_setepaddress
 ****************************************************************************/

static inline void stm32_setepaddress(uint8_t epno, uint16_t addr)
{
  uint32_t epaddr = STM32_USB_EPR(epno);
  uint32_t regval;

  regval  = stm32_getreg(epaddr);
  regval &= EPR_NOTOG_MASK;
  regval &= ~USB_EPR_EA_MASK;
  regval |= (addr << USB_EPR_EA_SHIFT);
  stm32_putreg(regval, epaddr);
}

/****************************************************************************
 * Name: stm32_seteptype
 ****************************************************************************/

